README.org
#+TITLE:     SVN aliases
#+AUTHOR:    Fabrice Niessen
#+EMAIL:     (concat "fniessen" at-sign "pirilampo.org")
#+DESCRIPTION: Pretty format for `git log' and different helpful command aliases
#+KEYWORDS:  git, log, pretty format, alias
#+LANGUAGE:  en
#+OPTIONS:   H:4 num:nil toc:2

#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup

#+EXPORT_EXCLUDE_TAGS: noexport

Doc: http://liris.cnrs.fr/seminaires/documents/seminaire_tuto_SVN.pdf

* How to fix "unable to create pristine install stream"

#+begin_src shell
cd .svn
rm -rf tmp
mkdir tmp
#+end_src

* colordiff

Use ~colordiff~ for my ~svn diff~ command (set in =~/.subversion/config=):

#+begin_src shell
diff-cmd = colordiff
#+end_src

* SHOW - View your changes

To *compare all modified files* in your working copy with the ~HEAD~ revision in the
repository, use the following command:

#+begin_src shell
alias svn-diffall="svn status | grep '^M' | awk '{print $2}' | xargs svn diff -r HEAD"
#+end_src

Colored ~svn diff~ command like ~git diff~.

#+begin_src shell
alias svn-diff='svn diff --diff-cmd=colordiff --extensions=" -u --strip-trailing-cr --ignore-space-change " | less --quit-if-one-screen'
#+end_src

#+begin_tip
EXCELLENT option ~--strip-trailing-cr~!
#+end_tip

* SHOW - View the commit history

The following aliases are interesting for using SVN a bit like Git.

** One-line log format ('git log')

#+begin_src shell :tangle bin/svn-short-log
#!/usr/bin/awk -f

# Original author: Plexus.

# Convert the "svn log" output into a one liner format, which is easier to grep
# or use in scripts. Pipe "svn log" into this script

# When we get a line that starts with a revision number, put the data in variables
/^r[0-9]+/ {
    rev=$1
    user=$3
    date=$5
    time=$6
}

# Anything that isn't a revision line, a separator line or an empty line
# will be part of the commit message. Concatenate these into the comment variable
! (/^r[0-9+]/ || /^-+$/ || /^$/) {
  comment = comment $0 " "
}

# With every separator line, output what we stored before and reset the comment variable
# To skip the first line we also check if we've already stored a revision
/^-+$/ && rev {
   print date " | " rev " | " user " | " comment
   comment = ""
}
#+end_src

#+begin_src shell :tangle bin/svn-log
# Usage: svn-log
svn log \
    | svn-short-log \
    | sed -e 's/^\(.*\) | \(.*\) | \(.*\) | \(.*\)$/\o33\[0;33m\1\o33[0m \o33\[0;32m\2\o33[0m \4\o33\[1;34m<\3>/' \
    | less -RF
#+end_src

** Make status checks of your working copy easier

Add them to your ~.bashrc~:

#+begin_src shell
alias svnl="svn log -r 1:HEAD -v"       # Show log messages.
alias svnm="svn status -u -q"           # Show locally/repository changed items.
alias svnn="svn status -q"              # Show locally changed items.
alias svns="svn status -u -q -v"        # Show status of all items.
#+end_src

** Show a single revision ('git show')

#+begin_src shell
svn diff -c 4795                        # Or svn diff -r 4795:4792.
#+end_src

See ~svn-show~ and ~svn-showtool~ in my Shell configuration.

** List all the changed files in a commit

Output filenames of files changed in each commit:

#+begin_src shell
svn log -v
#+end_src

See ~svn-changed-files~ in my Shell configuration.

** Show the history of a file

To view all historical changes to a file in SVN:

#+begin_src shell
svn log -q path/to/file | grep "^r" | awk '{print $1}' # List of revisions.
#+end_src

See ~svn-filelog~ in my Shell configuration.

#+begin_src shell
svn log --diff path/to/file
#+end_src

See ~svn-filelog-p~ in my Shell configuration.

* REVERT - Undo things

~svn merge -r 1944:1943 .~ should revert the changes of ~r1944~ in your working
copy. You can then review the changes in your working copy (with diff), but
you'd need to commit in order to apply the revert into the repository.

** "Unmodify" files

To discard local changes in current folder (revert a whole directory of files) :

#+begin_src shell
svn revert -R .
#+end_src

** "Unadd" a file to SVN before commit

: svn rm --keep-local folder_name

because

: svn revert --recursive folder_name

is unsafe, as it looses all local changes.

