README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SVN aliases</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Fabrice Niessen" />
<meta name="description" content="Pretty format for `git log' and different helpful command aliases"
 />
<meta name="keywords" content="git, log, pretty format, alias" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">SVN aliases</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8d9ded5">How to fix &ldquo;unable to create pristine install stream&rdquo;</a></li>
<li><a href="#org64736df">colordiff</a></li>
<li><a href="#orgb3e3b2c">SHOW - View your changes</a></li>
<li><a href="#org4cd3222">SHOW - View the commit history</a>
<ul>
<li><a href="#org9a2db0c">One-line log format (&rsquo;git log&rsquo;)</a></li>
<li><a href="#org3d95b34">Make status checks of your working copy easier</a></li>
<li><a href="#org02f4830">Show a single revision (&rsquo;git show&rsquo;)</a></li>
<li><a href="#orgff14e5a">List all the changed files in a commit</a></li>
<li><a href="#org8455092">Show the history of a file</a></li>
</ul>
</li>
<li><a href="#org549ceff">REVERT - Undo things</a>
<ul>
<li><a href="#orgc733695">&ldquo;Unmodify&rdquo; files</a></li>
<li><a href="#orgcfdd725">&ldquo;Unadd&rdquo; a file to SVN before commit</a></li>
</ul>
</li>
<li><a href="#org60255d9">Conflicts</a></li>
<li><a href="#orgfac8cd4">UPDATE - Pull</a>
<ul>
<li><a href="#org52aed76">Check for incoming changes</a></li>
<li><a href="#org712c4cf">Preview incoming changes</a></li>
<li><a href="#orgb4e88ae">Checkout a specific older version of the source code</a></li>
</ul>
</li>
<li><a href="#orgb2f5f06">Ignore files</a>
<ul>
<li><a href="#orge77e2c4">Ignore files from the command line</a></li>
</ul>
</li>
<li><a href="#org361d770">PUBLISH - Prepare a release</a></li>
<li><a href="#orgae3ff5c">Commands</a></li>
</ul>
</div>
</div>
<p>
Doc: <a href="http://liris.cnrs.fr/seminaires/documents/seminaire_tuto_SVN.pdf">http://liris.cnrs.fr/seminaires/documents/seminaire_tuto_SVN.pdf</a>
</p>

<div id="outline-container-org8d9ded5" class="outline-2">
<h2 id="org8d9ded5">How to fix &ldquo;unable to create pristine install stream&rdquo;</h2>
<div class="outline-text-2" id="text-org8d9ded5">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">cd</span> .svn
rm -rf tmp
mkdir tmp
</pre>
</div>
</div>
</div>

<div id="outline-container-org64736df" class="outline-2">
<h2 id="org64736df">colordiff</h2>
<div class="outline-text-2" id="text-org64736df">
<p>
Use <code>colordiff</code> for my <code>svn diff</code> command (set in <code>~/.subversion/config</code>):
</p>

<div class="org-src-container">
<pre class="src src-shell">diff-cmd = colordiff
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3e3b2c" class="outline-2">
<h2 id="orgb3e3b2c">SHOW - View your changes</h2>
<div class="outline-text-2" id="text-orgb3e3b2c">
<p>
To <b>compare all modified files</b> in your working copy with the <code>HEAD</code> revision in the
repository, use the following command:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> svn-diffall=<span class="org-string">"svn status | grep '^M' | awk '{print $2}' | xargs svn diff -r HEAD"</span>
</pre>
</div>

<p>
Colored <code>svn diff</code> command like <code>git diff</code>.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> svn-diff=<span class="org-string">'svn diff --diff-cmd=colordiff --extensions=" -u --strip-trailing-cr --ignore-space-change " | less --quit-if-one-screen'</span>
</pre>
</div>

<div class="tip">
<p>
EXCELLENT option <code>--strip-trailing-cr</code>!
</p>

</div>
</div>
</div>

<div id="outline-container-org4cd3222" class="outline-2">
<h2 id="org4cd3222">SHOW - View the commit history</h2>
<div class="outline-text-2" id="text-org4cd3222">
<p>
The following aliases are interesting for using SVN a bit like Git.
</p>
</div>

<div id="outline-container-org9a2db0c" class="outline-3">
<h3 id="org9a2db0c">One-line log format (&rsquo;git log&rsquo;)</h3>
<div class="outline-text-3" id="text-org9a2db0c">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter">#</span><span class="org-comment">!/usr/bin/</span><span class="org-keyword">awk</span><span class="org-comment"> -f</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Original author: Plexus.</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Convert the "svn log" output into a one liner format, which is easier to grep</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">or use in scripts. Pipe "svn log" into this script</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">When we get a line that starts with a revision number, put the data in variables</span>
/^r[0-9]+/ {
    <span class="org-variable-name">rev</span>=$<span class="org-variable-name">1</span>
    <span class="org-variable-name">user</span>=$<span class="org-variable-name">3</span>
    <span class="org-variable-name">date</span>=$<span class="org-variable-name">5</span>
    <span class="org-variable-name">time</span>=$<span class="org-variable-name">6</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">Anything that isn't a revision line, a separator line or an empty line</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">will be part of the commit message. Concatenate these into the comment variable</span>
<span class="org-negation-char">!</span> (/^r[0-9+]/ || /^-+$/ || /^$/) {
  comment = comment $<span class="org-variable-name">0</span> <span class="org-string">" "</span>
}

<span class="org-comment-delimiter"># </span><span class="org-comment">With every separator line, output what we stored before and reset the comment variable</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">To skip the first line we also check if we've already stored a revision</span>
/^-+$/ &amp;&amp; rev {
   print date <span class="org-string">" | "</span> rev <span class="org-string">" | "</span> user <span class="org-string">" | "</span> comment
   comment = <span class="org-string">""</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svn-log</span>
svn log <span class="org-sh-escaped-newline">\</span>
    | svn-short-log <span class="org-sh-escaped-newline">\</span>
    | sed -e <span class="org-string">'s/^\(.*\) | \(.*\) | \(.*\) | \(.*\)$/\o33\[0;33m\1\o33[0m \o33\[0;32m\2\o33[0m \4\o33\[1;34m&lt;\3&gt;/'</span> <span class="org-sh-escaped-newline">\</span>
    | less -RF
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d95b34" class="outline-3">
<h3 id="org3d95b34">Make status checks of your working copy easier</h3>
<div class="outline-text-3" id="text-org3d95b34">
<p>
Add them to your <code>.bashrc</code>:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> <span class="org-variable-name">svnl</span>=<span class="org-string">"svn log -r 1:HEAD -v"</span>       <span class="org-comment-delimiter"># </span><span class="org-comment">Show log messages.</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">svnm</span>=<span class="org-string">"svn status -u -q"</span>           <span class="org-comment-delimiter"># </span><span class="org-comment">Show locally/repository changed items.</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">svnn</span>=<span class="org-string">"svn status -q"</span>              <span class="org-comment-delimiter"># </span><span class="org-comment">Show locally changed items.</span>
<span class="org-builtin">alias</span> <span class="org-variable-name">svns</span>=<span class="org-string">"svn status -u -q -v"</span>        <span class="org-comment-delimiter"># </span><span class="org-comment">Show status of all items.</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org02f4830" class="outline-3">
<h3 id="org02f4830">Show a single revision (&rsquo;git show&rsquo;)</h3>
<div class="outline-text-3" id="text-org02f4830">
<div class="org-src-container">
<pre class="src src-shell">svn diff -c 4795                        <span class="org-comment-delimiter"># </span><span class="org-comment">Or svn diff -r 4795:4792.</span>
</pre>
</div>

<p>
See <code>svn-show</code> and <code>svn-showtool</code> in my Shell configuration.
</p>
</div>
</div>

<div id="outline-container-orgff14e5a" class="outline-3">
<h3 id="orgff14e5a">List all the changed files in a commit</h3>
<div class="outline-text-3" id="text-orgff14e5a">
<p>
Output filenames of files changed in each commit:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn log -v
</pre>
</div>

<p>
See <code>svn-changed-files</code> in my Shell configuration.
</p>
</div>
</div>

<div id="outline-container-org8455092" class="outline-3">
<h3 id="org8455092">Show the history of a file</h3>
<div class="outline-text-3" id="text-org8455092">
<p>
To view all historical changes to a file in SVN:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn log -q path/to/file | grep <span class="org-string">"^r"</span> | awk <span class="org-string">'{print $1}'</span> <span class="org-comment-delimiter"># </span><span class="org-comment">List of revisions.</span>
</pre>
</div>

<p>
See <code>svn-filelog</code> in my Shell configuration.
</p>

<div class="org-src-container">
<pre class="src src-shell">svn log --diff path/to/file
</pre>
</div>

<p>
See <code>svn-filelog-p</code> in my Shell configuration.
</p>
</div>
</div>
</div>

<div id="outline-container-org549ceff" class="outline-2">
<h2 id="org549ceff">REVERT - Undo things</h2>
<div class="outline-text-2" id="text-org549ceff">
<p>
<code>svn merge -r 1944:1943 .</code> should revert the changes of <code>r1944</code> in your working
copy. You can then review the changes in your working copy (with diff), but
you&rsquo;d need to commit in order to apply the revert into the repository.
</p>
</div>

<div id="outline-container-orgc733695" class="outline-3">
<h3 id="orgc733695">&ldquo;Unmodify&rdquo; files</h3>
<div class="outline-text-3" id="text-orgc733695">
<p>
To discard local changes in current folder (revert a whole directory of files) :
</p>

<div class="org-src-container">
<pre class="src src-shell">svn revert -R .
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcfdd725" class="outline-3">
<h3 id="orgcfdd725">&ldquo;Unadd&rdquo; a file to SVN before commit</h3>
<div class="outline-text-3" id="text-orgcfdd725">
<pre class="example">
svn rm --keep-local folder_name
</pre>


<p>
because
</p>

<pre class="example">
svn revert --recursive folder_name
</pre>


<p>
is unsafe, as it looses all local changes.
</p>
</div>
</div>
</div>
