README.html

<div id="outline-container-org60255d9" class="outline-2">
<h2 id="org60255d9">Conflicts</h2>
<div class="outline-text-2" id="text-org60255d9">
<p>
Files marked as <b>conflicted</b> show up with a C in <code>svn status</code>, and SVN will refuse
to commit such files.
</p>

<p>
Use <code>svn resolved filename</code> to mark a conflicted file as resolved:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn status -q

svn resolve --accept=theirs-full
svn resolved (FILE)

svn status -q
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfac8cd4" class="outline-2">
<h2 id="orgfac8cd4">UPDATE - Pull</h2>
<div class="outline-text-2" id="text-orgfac8cd4">
<p>
<a href="http://stackoverflow.com/questions/182945/how-to-see-what-will-be-updated-from-repository-before-issuing-svn-update-comm">http://stackoverflow.com/questions/182945/how-to-see-what-will-be-updated-from-repository-before-issuing-svn-update-comm</a>
</p>

<p>
Depending on what you want to know between your working copy and the latest SVN
server repository, without updating your local working copy, here is what you
can do:
</p>

<p>
If you want to know what has been changed in SVN server repository, run command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn st -u
</pre>
</div>

<p>
If you want to know if the same file has been modified both in your local
working copy and in SVN server repository, run command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn st -u | grep -i <span class="org-string">"^M \{7\}\*"</span>
</pre>
</div>

<p>
If you want to get <b>list of files changed</b> between a particular revision and <code>HEAD</code>,
run the command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r revisionNumber:HEAD --summarize
</pre>
</div>

<p>
If you want to get a list of files changed between particular revisions, run the
command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r revisionNumber:anotherRevisionNumber --summarize
</pre>
</div>

<p>
If you want to know what content of a particular file has been changed in SVN
server repository compared with your working copy, run the command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r BASE:HEAD path/to/file
</pre>
</div>

<p>
If you want to know what contents of all the files have been changed in SVN
server repository compared with your working copy, run the command:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r BASE:HEAD .
</pre>
</div>

<p>
If you want to get a <b>list of all files that were changed on the branch</b> (created,
say, at revision 22334) compared to what&rsquo;s on the trunk (without seeing files
that were changed on the trunk between when the branch was created and &ldquo;now&rdquo;):
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r 22334:HEAD --summarize &lt;url of the branch&gt;
</pre>
</div>
</div>

<div id="outline-container-org52aed76" class="outline-3">
<h3 id="org52aed76">Check for incoming changes</h3>
<div class="outline-text-3" id="text-org52aed76">
<p>
Show which files are modified in the repository (with an <code>*</code>):
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> svn-incoming=<span class="org-string">'svn status -u | grep \*'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">svn log -r BASE:HEAD                    <span class="org-comment-delimiter"># </span><span class="org-comment">Equivalent of `git log'</span>
svn log --diff -r BASE:HEAD             <span class="org-comment-delimiter"># </span><span class="org-comment">Equivalent of `git log -p'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org712c4cf" class="outline-3">
<h3 id="org712c4cf">Preview incoming changes</h3>
<div class="outline-text-3" id="text-org712c4cf">
<p>
See what has been changed (how it&rsquo;s different from my working copy):
</p>

<div class="org-src-container">
<pre class="src src-shell">svn diff -r BASE:HEAD
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4e88ae" class="outline-3">
<h3 id="orgb4e88ae">Checkout a specific older version of the source code</h3>
<div class="outline-text-3" id="text-orgb4e88ae">
<p>
Assuming that the source has already been checked out (that is you have an
already existing folder&#x2026;), update the revision (say we want to get r4732):
</p>

<div class="org-src-container">
<pre class="src src-shell">svn update -r 4732
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb2f5f06" class="outline-2">
<h2 id="orgb2f5f06">Ignore files</h2>
<div class="outline-text-2" id="text-orgb2f5f06">
<p>
Edit the file ignoring.txt to put the files you want actually to ignore. Then
use this one to ignore the files listed in the file:
</p>

<pre class="example">
svn propset svn:ignore -F ignoring.txt .
</pre>


<p>
Note the dot at the end of the line. It tells SVN that the property is being set
on the current directory.
</p>

<p>
Delete the file:
</p>

<pre class="example">
rm ignoring.txt
</pre>


<p>
Finally commit,
</p>

<pre class="example">
svn ci --message "Ignore some files"
</pre>


<p>
You can then check which files are ignored via:
</p>

<pre class="example">
svn proplist -v
</pre>
</div>

<div id="outline-container-orge77e2c4" class="outline-3">
<h3 id="orge77e2c4">Ignore files from the command line</h3>
<div class="outline-text-3" id="text-orge77e2c4">
<p>
Add a file (or a file glob pattern) to ignore without deleting the previous
value of the <code>svn:ignore</code> property&#x2026; from the command line.
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svnignore admin/notes/\*.tex</span>

<span class="org-variable-name">target</span>=<span class="org-string">"$1"</span>
<span class="org-variable-name">targetdirectory</span>=$(<span class="org-sh-quoted-exec">dirname</span> $<span class="org-variable-name">target</span>)
<span class="org-variable-name">targetfilepattern</span>=$(<span class="org-sh-quoted-exec">basename</span> $<span class="org-variable-name">target</span>)

<span class="org-variable-name">svnignores</span>=$(<span class="org-sh-quoted-exec">svn</span> propget svn:ignore <span class="org-string">"$targetdirectory"</span>)
<span class="org-variable-name">svnignores</span>=<span class="org-string">"$svnignores"</span>$<span class="org-string">'\n'"$targetfilepattern"</span>
<span class="org-builtin">printf</span> <span class="org-string">"Ignore '$targetfilepattern'\n"</span>
svn propset svn:ignore <span class="org-string">"$svnignores"</span> <span class="org-string">"$targetdirectory"</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org361d770" class="outline-2">
<h2 id="org361d770">PUBLISH - Prepare a release</h2>
<div class="outline-text-2" id="text-org361d770">
<p>
SVN diff zip revision to deploy.
</p>

<p>
Make release package (get list of changed files via <code>svn diff</code> log and zip them):
</p>

<p>
svn-rev-patch:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">For one release only.</span>
svn diff -c 124 --summarize | cut -c 9- | xargs zip -9 commit-124.zip

<span class="org-comment-delimiter"># </span><span class="org-comment">For a range of releases (124 up to and INCLUDING 145).</span>
svn diff -r 123:145 --summarize | cut -c 9- | xargs zip -9 commit-124-145.zip
</pre>
</div>

<div class="note">
<p>
<code>-c REV</code> is equivalent to <code>-r REV-1:REV</code>.
</p>

</div>

<p>
This will create a ZIP file with the changed file(s) &#x2013; in an intact directory
structure &#x2013; from revision <code>123:HEAD</code>.
</p>
</div>
</div>
