README.org
* Commands
:PROPERTIES:
:header-args+: :tangle .shell/.aliases-svn
:END:

#+begin_src shell
# Search through files, ignoring .svn directories.
alias svn-find='find . -not \( -name .svn -prune \)'

# Grep a string in every SVN revision of a file.
# Usage: svn-grep-all-rev PATTERN FILE
svn-grep-all-rev() {
    svn log "$2" \
        | perl -n -e 'print "$1\n" if m/^r(\d*)\s+/' \
        | (
              while read revision; do
                  printf "\e[0;33m%s\e[0m\n" "Revision $revision:"
                  svn cat -r "$revision" "$2" | grep "$1"
                  printf '\n'
              done
          )
}
#+end_src

#+begin_src shell
# SVN repository path
alias svn-remote-get-url="svn info | egrep '^URL: (.*)' | sed s/URL\:\ //"
#+end_src

This alias can be used as:

#+begin_src shell :tangle no
svn COMMAND $(svn-remote-get-url)       # Retrieve the full RepoURL.
#+end_src

#+begin_src shell :tangle bin/svn-status
svn status \
    | sed -e 's/^\(\([A-Z]\s\+\(+\s\+\)\?\)\?C .*\)$/\o33\[1;35m\1\o33[0m/' \
          -e 's/^\(\s*M.*\)$/\o33\[1;33m\1\o33[0m/' \
          -e 's/^\(A.*\)$/\o33\[1;32m\1\o33[0m/' \
          -e 's/^\(?.*\)$/\o33\[0;36m\1\o33[0m/' \
          -e 's/^\(\(D\|~\).*\)$/\o33\[1;31m\1\o33[0m/' \
    | less -RF
#+end_src

#+begin_src shell
alias svn-st=svn-status
#+end_src

#+begin_src shell :tangle bin/svn-show
# Usage: svn-show @REV
svn diff -c "$1" | less
#+end_src

#+begin_src shell
# svn-showtool @REV PATH
svn-showtool() {
    svn diff --diff-cmd='meld' -c "$1" "$2"
}
#+end_src

#+begin_src shell
# Usage: svn-changed-files @REV
alias svn-changed-files='svn log -v -r'
#+end_src

#+begin_src shell
# Usage: svn-file-history PATH
svn-file-history() {
    svn log -q "$1" | grep --color=never "^r"
}
#+end_src

#+begin_src shell
# Usage: svn-file-history-diff PATH
svn-file-history-diff() {
    svn log --diff "$1" | less
}
#+end_src

#+begin_src shell
# Usage: svn-unmodify PATH
svn-unmodify() {
    svn revert "$1"
}
#+end_src

#+begin_src shell
alias svn-nevermind='read -p "Destroy all local changes? [y/N]" && [[ $REPLY =~ ^[yY] ]] && svn revert . -R && rm -rf $(awk -f <(echo "/^?/{print \$2}") <(svn status) ;)'
#+end_src

Nuclear version which:
- reverts tracked files (discards changes in the working directory), and
- cleans untracked files and directories (removes any new files).

See https://stackoverflow.com/questions/6204572/is-there-a-subversion-command-to-reset-the-working-copy.
