README.html

<div id="outline-container-orgae3ff5c" class="outline-2">
<h2 id="orgae3ff5c">Commands</h2>
<div class="outline-text-2" id="text-orgae3ff5c">
<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Search through files, ignoring .svn directories.</span>
<span class="org-builtin">alias</span> svn-find=<span class="org-string">'find . -not \( -name .svn -prune \)'</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">Grep a string in every SVN revision of a file.</span>
<span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svn-grep-all-rev PATTERN FILE</span>
<span class="org-function-name">svn-grep-all-rev</span>() {
    svn log <span class="org-string">"$2"</span> <span class="org-sh-escaped-newline">\</span>
        | perl -n -e <span class="org-string">'print "$1\n" if m/^r(\d*)\s+/'</span> <span class="org-sh-escaped-newline">\</span>
        | (
              <span class="org-keyword">while </span><span class="org-builtin">read</span> revision; <span class="org-keyword">do</span>
                  <span class="org-builtin">printf</span> <span class="org-string">"\e[0;33m%s\e[0m\n"</span> <span class="org-string">"Revision $revision:"</span>
                  svn cat -r <span class="org-string">"$revision"</span> <span class="org-string">"$2"</span> | grep <span class="org-string">"$1"</span>
                  <span class="org-builtin">printf</span> <span class="org-string">'\n'</span>
              <span class="org-keyword">done</span>
          )
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">SVN repository path</span>
<span class="org-builtin">alias</span> svn-remote-get-url=<span class="org-string">"svn info | egrep '^URL: (.*)' | sed s/URL\:\ //"</span>
</pre>
</div>

<p>
This alias can be used as:
</p>

<div class="org-src-container">
<pre class="src src-shell">svn COMMAND $(<span class="org-sh-quoted-exec">svn-remote-get-url</span>)       <span class="org-comment-delimiter"># </span><span class="org-comment">Retrieve the full RepoURL.</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">svn status <span class="org-sh-escaped-newline">\</span>
    | sed -e <span class="org-string">'s/^\(\([A-Z]\s\+\(+\s\+\)\?\)\?C .*\)$/\o33\[1;35m\1\o33[0m/'</span> <span class="org-sh-escaped-newline">\</span>
          -e <span class="org-string">'s/^\(\s*M.*\)$/\o33\[1;33m\1\o33[0m/'</span> <span class="org-sh-escaped-newline">\</span>
          -e <span class="org-string">'s/^\(A.*\)$/\o33\[1;32m\1\o33[0m/'</span> <span class="org-sh-escaped-newline">\</span>
          -e <span class="org-string">'s/^\(?.*\)$/\o33\[0;36m\1\o33[0m/'</span> <span class="org-sh-escaped-newline">\</span>
          -e <span class="org-string">'s/^\(\(D\|~\).*\)$/\o33\[1;31m\1\o33[0m/'</span> <span class="org-sh-escaped-newline">\</span>
    | less -RF
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> svn-st=svn-status
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svn-show @REV</span>
svn diff -c <span class="org-string">"$1"</span> | less
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">svn-showtool @REV PATH</span>
<span class="org-function-name">svn-showtool</span>() {
    svn diff --diff-cmd=<span class="org-string">'meld'</span> -c <span class="org-string">"$1"</span> <span class="org-string">"$2"</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svn-changed-files @REV</span>
<span class="org-builtin">alias</span> svn-changed-files=<span class="org-string">'svn log -v -r'</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svn-file-history PATH</span>
<span class="org-function-name">svn-file-history</span>() {
    svn log -q <span class="org-string">"$1"</span> | grep --color=never <span class="org-string">"^r"</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svn-file-history-diff PATH</span>
<span class="org-function-name">svn-file-history-diff</span>() {
    svn log --diff <span class="org-string">"$1"</span> | less
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-comment-delimiter"># </span><span class="org-comment">Usage: svn-unmodify PATH</span>
<span class="org-function-name">svn-unmodify</span>() {
    svn revert <span class="org-string">"$1"</span>
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell"><span class="org-builtin">alias</span> svn-nevermind=<span class="org-string">'read -p "Destroy all local changes? [y/N]" &amp;&amp; [[ $REPLY =~ ^[yY] ]] &amp;&amp; svn revert . -R &amp;&amp; rm -rf $(</span><span class="org-sh-quoted-exec">awk</span><span class="org-string"> -f &lt;(echo "/^?/{print \$2}") &lt;(svn status) ;)'</span>
</pre>
</div>

<p>
Nuclear version which:
</p>
<ul class="org-ul">
<li>reverts tracked files (discards changes in the working directory), and</li>
<li>cleans untracked files and directories (removes any new files).</li>
</ul>

<p>
See <a href="https://stackoverflow.com/questions/6204572/is-there-a-subversion-command-to-reset-the-working-copy">https://stackoverflow.com/questions/6204572/is-there-a-subversion-command-to-reset-the-working-copy</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Fabrice Niessen</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
